app/views/bets/edit.html.erb

SELECT "usuarios".* FROM "usuarios"
---
							</span>
							<% @usuarios = Usuario.all %>