app/views/bets/index.html.erb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT 1  [["id", 14]]
---
            <td><%= bet.description.to_s.force_encoding("UTF-8") %></td>
            <% user = Usuario.find(bet.usuario_id) %>