app/views/bets/new.html.erb

SELECT "usuarios".* FROM "usuarios"
---
                </span>
                <% @usuarios = Usuario.all %>