app/controllers/usuarios_controller.rb

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."email" = $1 AND "usuarios"."provider" = $2 LIMIT 1  [["email", "abc"], ["provider", "email"]]
---
  def login

  	@usuario = Usuario.find_by(email: usuario_params[:email], provider: "email")

INSERT INTO "usuarios" ("name", "email", "access_token", "provider", "status", "user_type", "data_ingresso", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def cadastro_create
  	@usuario = Usuario.new(usuario_params)
  	@usuario.provider = "email"
  	@usuario.status = true
  	@usuario.user_type = "2"
  	@usuario.data_ingresso = Time.now

    respond_to do |format|
      if @usuario.save

INSERT INTO "usuarios" ("name", "email", "access_token", "provider", "status", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE "usuarios" SET "status" = $1, "updated_at" = $2 WHERE "usuarios"."id" = $3  [["status", "f"], ["updated_at", "2016-11-15 00:14:05.542682"], ["id", 20]]
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

DELETE FROM "usuarios" WHERE "usuarios"."id" = $1  [["id", 6]]
---
  def destroy
    @usuario.destroy