app/controllers/welcome_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  [["id", 47]]
---
  def painel

    if session[:user_id] == nil
			redirect_to action: 'index', :notice => "Por favor efetue o login"
    end
    else
      @usuarios = Usuario.where(id: session[:user_id])